# Chapter 7 Data Cleaning and Preparation

## 7.1 Handling Missing Data

In [2]:
import pandas as pd
import numpy as np

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.dropna()

0     aardvark
1    artichoke
3      avocado
dtype: object

In [6]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

### Filtering Out Missing Data

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
....: [NA, NA, NA], [NA, 6.5, 3.]])

In [12]:
cleaned = data.dropna()

In [13]:
data.dropna(how = 'all') # only drop rows with all elements na

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(how = 'all', axis = 1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# Drop rows/columns with certain number of NAs: thresh
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.317862       NaN       NaN
1  0.814030       NaN       NaN
2 -0.610289       NaN  1.317067
3 -0.518709       NaN  0.605847
4 -0.802284 -0.198569 -0.132871
5  0.467289 -0.452894  0.453134
6  1.336794 -0.401744  0.248318

In [17]:
df.dropna(thresh = 2) # Cannnot be used for column??

          0         1         2
2 -0.610289       NaN  1.317067
3 -0.518709       NaN  0.605847
4 -0.802284 -0.198569 -0.132871
5  0.467289 -0.452894  0.453134
6  1.336794 -0.401744  0.248318

### Filling in Missing Data

In [18]:
# fill with 0
df.fillna(0)

          0         1         2
0 -0.317862  0.000000  0.000000
1  0.814030  0.000000  0.000000
2 -0.610289  0.000000  1.317067
3 -0.518709  0.000000  0.605847
4 -0.802284 -0.198569 -0.132871
5  0.467289 -0.452894  0.453134
6  1.336794 -0.401744  0.248318

In [19]:
# different fill values for different columns
df.fillna({1:0.5, 2:0.44})

          0         1         2
0 -0.317862  0.500000  0.440000
1  0.814030  0.500000  0.440000
2 -0.610289  0.500000  1.317067
3 -0.518709  0.500000  0.605847
4 -0.802284 -0.198569 -0.132871
5  0.467289 -0.452894  0.453134
6  1.336794 -0.401744  0.248318

In [20]:
# Modify the existing object instead of creating a new one
_ = df.fillna(0, inplace = True)
df

          0         1         2
0 -0.317862  0.000000  0.000000
1  0.814030  0.000000  0.000000
2 -0.610289  0.000000  1.317067
3 -0.518709  0.000000  0.605847
4 -0.802284 -0.198569 -0.132871
5  0.467289 -0.452894  0.453134
6  1.336794 -0.401744  0.248318

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.057732 -0.101218 -0.253138
1 -1.191651 -0.667099  2.005096
2  1.282168       NaN -0.173548
3  1.031754       NaN  0.369423
4 -0.567458       NaN       NaN
5 -0.147319       NaN       NaN

In [22]:
df.fillna(method = 'ffill')

          0         1         2
0  1.057732 -0.101218 -0.253138
1 -1.191651 -0.667099  2.005096
2  1.282168 -0.667099 -0.173548
3  1.031754 -0.667099  0.369423
4 -0.567458 -0.667099  0.369423
5 -0.147319 -0.667099  0.369423

In [23]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  1.057732 -0.101218 -0.253138
1 -1.191651 -0.667099  2.005096
2  1.282168 -0.667099 -0.173548
3  1.031754 -0.667099  0.369423
4 -0.567458       NaN  0.369423
5 -0.147319       NaN  0.369423

In [24]:
df.fillna(df.mean()) # fill using the column mean

          0         1         2
0  1.057732 -0.101218 -0.253138
1 -1.191651 -0.667099  2.005096
2  1.282168 -0.384158 -0.173548
3  1.031754 -0.384158  0.369423
4 -0.567458 -0.384158  0.486958
5 -0.147319 -0.384158  0.486958

## 7.2 Data Transformation

In [25]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [26]:
# return duplicated rows
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [27]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.drop_duplicates(['k1'], keep = 'last')

    k1  k2  v1
4  one   3   4
6  two   4   6

In [30]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [40]:
data = pd.DataFrame({'food':['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 
                            'honey ham', 'nova lox'], 
                   'ounces':[4,3,12,6,7.5, 8, 3, 5, 6]})

In [41]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
meat_to_animal = {
    'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow',
    'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'
}

In [43]:
# lower case 
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
# Add a new column to store the animal type
data['animal'] = lowercased.map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
# We can combine lower case and map together:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing values

In [47]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [48]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [50]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [51]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### Renaming Axis Indexes

In [53]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

In [54]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [55]:
transform = lambda x: x[:4].upper()

In [58]:
data.index = data.index.map(transform)

In [59]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [60]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [61]:
data.rename(index=str.upper, columns=str.title)

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [63]:
data.rename(index = {'OHIO': 'INDIANA'}, columns = {'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [64]:
data.rename(index = {'OHIO': 'INDIANA'}, inplace = True)

In [65]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binning

In [67]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [70]:
bins = [18, 25, 35, 60, 100]

In [72]:
cats = pd.cut(ages, bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [75]:
# cats here is an categorical object
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [76]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [77]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [78]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [79]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [80]:
pd.cut(ages, bins, labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [81]:
# If you pass an integer number of bins to cut instead of explicit bin edges, it will com‐pute equal-length bins based on the minimum and maximum values in the data
data = np.random.rand(20)

In [82]:
pd.cut(data, 4, precision = 2)

[(0.69, 0.91], (0.48, 0.69], (0.05, 0.27], (0.05, 0.27], (0.27, 0.48], ..., (0.05, 0.27], (0.27, 0.48], (0.69, 0.91], (0.05, 0.27], (0.69, 0.91]]
Length: 20
Categories (4, interval[float64]): [(0.05, 0.27] < (0.27, 0.48] < (0.48, 0.69] < (0.69, 0.91]]

In [83]:
# 'qcut' bins the data based on sample quantiles.
data = np.random.randn(1000)

In [84]:
cats = pd.qcut(data, 4)

In [85]:
cats

[(-3.835, -0.68], (-0.00461, 0.66], (0.66, 2.929], (0.66, 2.929], (-3.835, -0.68], ..., (-0.00461, 0.66], (0.66, 2.929], (-0.68, -0.00461], (-0.68, -0.00461], (0.66, 2.929]]
Length: 1000
Categories (4, interval[float64]): [(-3.835, -0.68] < (-0.68, -0.00461] < (-0.00461, 0.66] < (0.66, 2.929]]

In [86]:
pd.value_counts(cats)

(0.66, 2.929]        250
(-0.00461, 0.66]     250
(-0.68, -0.00461]    250
(-3.835, -0.68]      250
dtype: int64

In [87]:
# my own quantiles
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.203, -0.00461], (-0.00461, 1.213], (-0.00461, 1.213], (-0.00461, 1.213], (-1.203, -0.00461], ..., (-0.00461, 1.213], (1.213, 2.929], (-1.203, -0.00461], (-1.203, -0.00461], (-0.00461, 1.213]]
Length: 1000
Categories (4, interval[float64]): [(-3.835, -1.203] < (-1.203, -0.00461] < (-0.00461, 1.213] < (1.213, 2.929]]

### Detecting and Filtering Outliers

In [88]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [90]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.056365    -0.018484     0.044988    -0.061552
std       1.010821     0.991063     1.016793     0.990781
min      -3.086537    -2.892388    -4.233499    -3.496768
25%      -0.712975    -0.699567    -0.608704    -0.693197
50%      -0.083616     0.019963     0.048957    -0.085451
75%       0.602207     0.673842     0.716635     0.590076
max       3.398483     3.573751     3.747684     2.735712

In [92]:
data[2][np.abs(col)>3]

377    3.747684
555   -4.233499
Name: 2, dtype: float64

In [96]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
48   3.054571 -1.188467 -0.766330  1.673513
52   3.398483  0.164230 -0.547297 -0.358064
70  -1.315290  3.573751 -0.522710 -0.694098
377 -0.571439  0.728994  3.747684 -1.285580
547  3.044537 -0.316901 -0.713805 -1.917910
555 -0.930940 -0.220043 -4.233499  1.452320
635 -3.086537  0.500552  0.870713 -0.376028
819  1.259399  2.046776 -0.352038 -3.496768

In [97]:
data[np.abs(data)>3] = np.sign(data) * 3

In [98]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.056776    -0.019058     0.045474    -0.061055
std       1.008976     0.989145     1.009872     0.989180
min      -3.000000    -2.892388    -3.000000    -3.000000
25%      -0.712975    -0.699567    -0.608704    -0.693197
50%      -0.083616     0.019963     0.048957    -0.085451
75%       0.602207     0.673842     0.716635     0.590076
max       3.000000     3.000000     3.000000     2.735712

In [99]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1 -1.0  1.0 -1.0  1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0  1.0 -1.0
4  1.0  1.0  1.0 -1.0

### Permutation and Random Sampling

In [103]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [104]:
sampler = np.random.permutation(5)

In [106]:
sampler

array([1, 0, 2, 4, 3])

In [107]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19
3  12  13  14  15

In [109]:
# To choose a random subset, without replacement:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15

In [110]:
# Subset with replacement:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)

In [111]:
draws

1    7
0    5
0    5
4    4
4    4
4    4
0    5
4    4
0    5
2   -1
dtype: int64

### Computing Indicator/Dummy Variables

In [113]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 
                  'data1': range(6)})

In [114]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [115]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [116]:
dummies = pd.get_dummies(df['key'], prefix='key')
dummies

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [117]:
df_with_dummy = df[['data1']].join(dummies)

In [118]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

## 7.3 String Manipulation

In [119]:
val = 'a,b,  guido'

In [120]:
val.split(',')

['a', 'b', '  guido']

In [123]:
# strip to trim whitespace
pieces = [x.strip() for x in val.split(',')]

In [124]:
pieces

['a', 'b', 'guido']

In [125]:
first, second, third = pieces

In [127]:
# substrings could be concatenated together with a two-colon delimiter using addition
first + '::' + second + '::' + third

'a::b::guido'

In [128]:
first  + second + third

'abguido'

In [129]:
':'.join(pieces)

'a:b:guido'

In [133]:
val.find(':') # -1 means string not found

-1

In [135]:
val.count(',')

2

In [136]:
val.replace(',', 'I am comma')

'aI am commabI am comma  guido'

### Regular Expressions

#### The re module functions fall into three categories: pattern matching, substitution, and splitting

In [137]:
import re

In [138]:
text = "foo   bar\t baz  \tqux"

In [139]:
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [140]:
regex = re.compile('\s+')

In [141]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [142]:
regex.findall(text)

['   ', '\t ', '  \t']

In [150]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
fatjodie0510@yahoo.com Judy's email
"""

In [151]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
# pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [152]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [153]:
regex.findall(text)

['dave@google.com',
 'steve@gmail.com',
 'rob@gmail.com',
 'ryan@yahoo.com',
 'fatjodie0510@yahoo.com']

In [154]:
m = regex.search(text)

In [155]:
m

In [156]:
text[m.start():m.end()]

'dave@google.com'

In [157]:
# regex.match returns None, as it only will match if the pattern occurs at the start of the string
print(regex.match(text))

None

In [158]:
# sub will return a new string with occurrences of the pattern replaced by the a new string:
print(regex.sub('email', text))

Dave email
Steve email
Rob email
Ryan email
email Judy's email

In [159]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [160]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [162]:
m = regex.match('wesm@gright.met')

In [164]:
m.groups()

('wesm', 'gright', 'met')

In [165]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com'),
 ('fatjodie0510', 'yahoo', 'com')]

In [166]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com
Username: fatjodie0510, Domain: yahoo, Suffix: com Judy's email

### Vectorized String Functions in pandas

In [170]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com', 'Rob': 'rob.yahoo.com', 'Wes': np.nan}

In [171]:
data = pd.Series(data)

In [172]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob.yahoo.com
Wes                  NaN
dtype: object

In [173]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob      False
Wes        NaN
dtype: object

In [175]:
data.str[:7]

Dave     dave@go
Steve    steve@g
Rob      rob.yah
Wes          NaN
dtype: object